export const PROVINCES: Record<string, string[]> = {
  'ນະຄອນຫຼວງວຽງຈັນ': [
    'ຈັນທະບູລີ', 'ສີໂຄດຕະບອງ', 'ໄຊເສດຖາ', 'ສີສັດຕະນາກ',
    'ນາຊາຍທອງ', 'ໄຊທານີ', 'ຫາດຊາຍຟອງ', 'ສັງທອງ', 'ປາກງື່ມ',
  ],
  'ແຂວງຜົ້ງສາລີ': [
    'ຜົ້ງສາລີ', 'ໃໝ່', 'ຊຽງຄ້ໍ', 'ຍອດ', 'ບຸນໃຕ້', 'ບຸນເໜືອ', 'ຂວາ',
  ],
  'ແຂວງຫຼວງນ້ຳທາ': [
    'ຫຼວງນ້ຳທາ', 'ສິງ', 'ວຽງພູຄາ', 'ລອງ', 'ນາແລ',
  ],
  'ແຂວງອຸດົມໄຊ': [
    'ໄຊ', 'ນາໝໍ', 'ຫຼ້າ', 'ແງ', 'ຮຸນ', 'ຊ້ານ', 'ຮ່ອງແລ',
  ],
  'ແຂວງບໍ່ແກ້ວ': [
    'ຫ້ວຍຊາຍ', 'ໂຕນ', 'ຜາອຸດົມ', 'ເມິ', 'ປາກທາ', 'ງ່ານ',
  ],
  'ແຂວງຫຼວງພະບາງ': [
    'ຫຼວງພະບາງ', 'ຈອມເພັດ', 'ນານ', 'ງອຍ', 'ປາກອູ',
    'ໂພນໄຊ', 'ນ້ຳບາກ', 'ໂຊນ', 'ວຽງໃໝ່', 'ປາກແຊງ', 'ຫີນຮ່ວງ', 'ຜາໄດ',
  ],
  'ແຂວງຫົວພັນ': [
    'ຊຳເໜືອ', 'ຊຽງຄໍ້', 'ວຽງທອງ', 'ວຽງໄຊ', 'ຫົວເມືອງ', 'ຊຳໃຕ້', 'ສົບເບົາ', 'ແອດ',
  ],
  'ແຂວງໄຊຍະບູລີ': [
    'ໄຊຍະບູລີ', 'ຄອບ', 'ພຽງ', 'ຝາງ', 'ທົ່ງມີໄຊ',
    'ໄຊລ້ານ', 'ປາກລາຍ', 'ຊຽງຮ່ອນ', 'ນາມ', 'ເຄືອນກາງ', 'ບ່ອນ', 'ໂພນໄຊ',
  ],
  'ແຂວງຊຽງຂວາງ': [
    'ແປກ', 'ຄຳ', 'ໜອງແຮດ', 'ຜາໄຊ', 'ຄູນ', 'ພູກູດ', 'ມອດ', 'ພູຊ້ານ', 'ໄຊຊຳພອນ',
  ],
  'ແຂວງວຽງຈັນ': [
    'ໂພນໂຮງ', 'ທຸລະຄົມ', 'ຫີນເຫີບ', 'ວັງວຽງ', 'ຄູນຄຳ',
    'ແກ້ວອຸດົມ', 'ສາຍທານີ', 'ຊ້ອນ', 'ໂດດ', 'ໂພນທອງ',
    'ວຽງຄຳ', 'ຫີນບູນ', 'ກາສີ',
  ],
  'ແຂວງໄຊສົມບູນ': [
    'ອະນຸວົງ', 'ລ້ອງ', 'ທ່າທອມ',
  ],
  'ແຂວງບໍລິຄຳໄຊ': [
    'ປາກຊັນ', 'ທ່າພະບາດ', 'ປາກກະດິງ', 'ບໍລິຄັນ', 'ຄຳເກີດ', 'ວຽງທອງ', 'ໄຊຈຳພອນ',
  ],
  'ແຂວງຄຳມ່ວນ': [
    'ທ່າແຂກ', 'ມະຫາໄຊ', 'ໜອງບົກ', 'ຫີນບູນ', 'ຍົມມະລາດ',
    'ບົວລະພາ', 'ນາກາຍ', 'ເຊບັ້ງໄຟ', 'ໄຊບົວທອງ',
  ],
  'ແຂວງສະຫວັນນະເຂດ': [
    'ໄກສອນ ພົມວິຫານ', 'ອຸທຸມພອນ', 'ອາດສະພັງທອງ', 'ພີນ', 'ເຊໂປນ',
    'ນອງ', 'ທ່າປາງທອງ', 'ສອງຄອນ', 'ຈຳພອນ', 'ຊົນນະບູລີ',
    'ໄຊບູລີ', 'ວີລະບຸລີ', 'ອາດສະພອນ', 'ໄຊພູທອງ', 'ພະລານໄຊ',
  ],
  'ແຂວງສາລະວັນ': [
    'ສາລາວັນ', 'ຕາໂອ້ຍ', 'ຕຸ້ມລານ', 'ລະຄອນເພັງ', 'ວາປີ', 'ຄົງເຊໂດນ', 'ເລົ່າງາມ', 'ສະມ້ວຍ',
  ],
  'ແຂວງເຊກອງ': [
    'ລະມາມ', 'ກະລຶມ', 'ທ່າຕ່ຳ', 'ດາກຈຶງ',
  ],
  'ແຂວງຈຳປາສັກ': [
    'ປາກເຊ', 'ຊະນະສົມບູນ', 'ບາຈຽງຈະເລີນສຸກ', 'ປາກຊ່ອງ', 'ປະທຸມພອນ',
    'ໂພນທອງ', 'ຈຳປາສັກ', 'ສຸຂຸມາ', 'ມູນລະປະໂມກ', 'ໂຂງ',
  ],
  'ແຂວງອັດຕະປື': [
    'ໄຊສະຖານ', 'ສະໝັກຄີໄຊ', 'ສະໜາມໄຊ', 'ສານໄຊ', 'ພູວົງ',
  ],
}

export const PROVINCE_LIST = Object.keys(PROVINCES)
