export const PROVINCES: Record<string, string[]> = {
  'ນະຄອນຫຼວງວຽງຈັນ': ['ຈັນທະບູລີ', 'ສີໂຄດຕະບອງ', 'ໄຊເສດຖາ', 'ສີສັດຕະນາກ', 'ນາຊາຍທອງ', 'ໄຊທານີ', 'ຫາດຊາຍຟອງ', 'ສັງທອງ', 'ປາກງື່ມ', 'ເມືອງໃໝ່'],
  'ແຂວງວຽງຈັນ': ['ໂພນໂຮງ', 'ທຸລະຄົມ', 'ຫີນເຫີບ', 'ວັງວຽງ', 'ຄູນຄຳ', 'ແກ້ວອຸດົມ', 'ສາຍທານີ', 'ຊ້ອນ', 'ໄຊສົມບູນ', 'ຫຼວງ', 'ໂດດ', 'ໂພນທອງ', 'ໂພນທັນ', 'ແກ່ນທ້າວ', 'ວຽງຄຳ', 'ຫີນບູນ', 'ທ່ານົກ', 'ໂຄກ', 'ຮ່ອງຈອກ'],
  'ແຂວງຊຽງຂວາງ': ['ແປກ', 'ຄຳ', 'ໜອງແຮດ', 'ຫົວເມືອງ', 'ຜາໄຊ', 'ຄູນ', 'ພູກູດ', 'ມອດ', 'ພູຊ້ານ'],
  'ແຂວງຫຼວງພະບາງ': ['ຫຼວງພະບາງ', 'ໂຊນ', 'ງອຍ', 'ປາກອູ', 'ນານ', 'ພູຄູນ', 'ຈອມເພັດ', 'ຫຼວງ', 'ໂພນໄຊ', 'ວຽງໃໝ່', 'ນ້ຳບາກ', 'ປາກແຊງ'],
  'ແຂວງຫົວພັນ': ['ຊຳເໜືອ', 'ກ້ວນ', 'ຮ້ານ', 'ວຽງໄຊ', 'ວຽງທອງ', 'ເຊືອນ', 'ໂຊນ', 'ຊຳໃຕ້', 'ເຊ'],
  'ແຂວງໄຊຍະບູລີ': ['ໄຊຍະບູລີ', 'ຄອບ', 'ພຽງ', 'ຝາງ', 'ບ່ອນເທ່ືອ', 'ທົ່ງມີໄຊ', 'ຮ່ອງຈອກ', 'ໄຊລ້ານ', 'ປາກລາຍ', 'ນາມ', 'ເຄືອນກາງ', 'ຊຽງຮ່ອນ'],
  'ແຂວງກຳມ່ວນ': ['ທ່າແຂກ', 'ນາກາຍ', 'ເທີນ', 'ຍ່ອມມະລາດ', 'ຊ່ອງລ່ອງ', 'ໄຊບົວທອງ', 'ໃຈ', 'ນອງ', 'ຫີນບູນ', 'ໄຊຈຳພອນ', 'ຊຶ່ງ', 'ບົວລະພາ'],
  'ແຂວງສະຫວັນນະເຂດ': ['ໄກສອນ ພົມວິຫານ', 'ສອງຄອນ', 'ວິລະບູລີ', 'ນອງ', 'ທ່ງ', 'ຊົ່ງ', 'ອາດສະພອນ', 'ໄຊບູລີ', 'ພີນ', 'ຊາມ', 'ຈຳລອນ', 'ເຊໂປນ', 'ສຸວັນນະ', 'ສາວນ','ທ່ານລາວ'],
  'ແຂວງສາລະວັນ': ['ສາລະວັນ', 'ທ່າແຕງ', 'ລະຄອນເພັງ', 'ດ່ານ', 'ຕ່ຶຶ່ງ', 'ລາໂອ', 'ຄົງ', 'ສາມຊ້ອຍ', 'ໂທ', 'ລ່ອງໂສ້ງ', 'ວາປີ'],
  'ແຂວງເຊກອງ': ['ລະມາມ', 'ກະລຶມ', 'ທ່າຕ່ຳ', 'ດາກຈຶງ'],
  'ແຂວງຈຳປາສັກ': ['ປາກເຊ', 'ຊະນະສົມບູນ', 'ໂພນທອງ', 'ບາດ', 'ປາກຊ່ອງ', 'ບຸ່ງລອ', 'ມູນລະປະໂມກ', 'ສຸຂຸມາ', 'ໂຂງ', 'ສານາສົມບູນ', 'ລາວງາມ', 'ນາຊານ', 'ຈຳເລີຍ'],
  'ແຂວງອັດຕະປື': ['ຊຳໃຕ້', 'ສາມ', 'ຊານ', 'ໂດ່', 'ໄຊສະຖານ', 'ຊ່ອງ', 'ປູວ', 'ສານ'],
  'ແຂວງຜົ້ງສາລີ': ['ຜົ້ງສາລີ', 'ໃໝ່', 'ຊຽງຄ້ໍ', 'ຍອດ', 'ບຸນໃຕ້', 'ບຸນເໜືອ', 'ຂວາ'],
  'ແຂວງລ້ານຊ້າງ': ['ຫຼວງ', 'ວຽງ', 'ດ່ານ', 'ຊຽງ'],
  'ແຂວງອຸດົມໄຊ': ['ໄຊ', 'ນາໝໍ', 'ຫຼ້າ', 'ແງ', 'ຮຸນ', 'ຊ້ານ', 'ຮ່ອງແລ', 'ທ່ງ', 'ພູຄ'],
  'ແຂວງບໍ່ແກ້ວ': ['ຫ້ວຍຊາຍ', 'ໂຕນ', 'ຜາອຸດົມ', 'ງ່ານ', 'ດ່ານ', 'ໄຊ', 'ພາກທີ', 'ເມິ', 'ຮ່ອງ'],
  'ແຂວງຫຼວງນ້ຳທາ': ['ຫຼວງນ້ຳທາ', 'ສິງ', 'ວຽງພູຄາ', 'ລອງ', 'ນາແລ'],
  'ແຂວງໄຊສົມບູນ': ['ອະນຸວົງ', 'ລ້ອງ', 'ທ່ານ'],
}

export const PROVINCE_LIST = Object.keys(PROVINCES)
