export const PROVINCES: Record<string, string[]> = {
  'ນະຄອນຫຼວງວຽງຈັນ': [
    'ຈັນທະບູລີ', 'ສີໂຄດຕະບອງ', 'ໄຊເສດຖາ', 'ສີສັດຕະນາກ',
    'ນາຊາຍທອງ', 'ໄຊທານີ', 'ຫາດຊາຍຟອງ', 'ສັງທອງ', 'ປາກງື່ມ',
  ],
  'ແຂວງຜົ້ງສາລີ': [
    'ຜົ້ງສາລີ', 'ໃໝ່', 'ຊຽງຄ້ໍ', 'ຍອດ', 'ບຸນໃຕ້', 'ບຸນເໜືອ', 'ຂວາ',
  ],
  'ແຂວງຫຼວງນ້ຳທາ': [
    'ຫຼວງນ້ຳທາ', 'ສິງ', 'ວຽງພູຄາ', 'ລອງ', 'ນາແລ',
  ],
  'ແຂວງອຸດົມໄຊ': [
    'ໄຊ', 'ນາໝໍ', 'ຫຼ້າ', 'ແງ', 'ຮຸນ', 'ຊ້ານ', 'ຮ່ອງແລ',
  ],
  'ແຂວງບໍ່ແກ້ວ': [
    'ຫ້ວຍຊາຍ', 'ໂຕນ', 'ຜາອຸດົມ', 'ເມິ', 'ປາກທາ', 'ງ່ານ',
  ],
  'ແຂວງຫຼວງພະບາງ': [
    'ຫຼວງພະບາງ', 'ຈອມເພັດ', 'ນານ', 'ງອຍ', 'ປາກອູ',
    'ໂພນໄຊ', 'ນ້ຳບາກ', 'ໂຊນ', 'ວຽງໃໝ່', 'ປາກແຊງ', 'ຫີນຮ່ວງ', 'ຜາໄດ',
  ],
  'ແຂວງຫົວພັນ': [
    'ຊຳເໜືອ', 'ວຽງໄຊ', 'ຮ້ານ', 'ກ້ວນ', 'ເຊືອນ',
    'ຊຳໃຕ້', 'ໂຊນ', 'ວຽງທອງ', 'ກ',
  ],
  'ແຂວງໄຊຍະບູລີ': [
    'ໄຊຍະບູລີ', 'ຄອບ', 'ພຽງ', 'ຝາງ', 'ທົ່ງມີໄຊ',
    'ໄຊລ້ານ', 'ປາກລາຍ', 'ຊຽງຮ່ອນ', 'ນາມ', 'ເຄືອນກາງ', 'ບ່ອນ', 'ໂພນໄຊ',
  ],
  'ແຂວງຊຽງຂວາງ': [
    'ແປກ', 'ຄຳ', 'ໜອງແຮດ', 'ຜາໄຊ', 'ຄູນ', 'ພູກູດ', 'ມອດ', 'ພູຊ້ານ', 'ໄຊຊຳພອນ',
  ],
  'ແຂວງວຽງຈັນ': [
    'ໂພນໂຮງ', 'ທຸລະຄົມ', 'ຫີນເຫີບ', 'ວັງວຽງ', 'ຄູນຄຳ',
    'ແກ້ວອຸດົມ', 'ສາຍທານີ', 'ຊ້ອນ', 'ໂດດ', 'ໂພນທອງ',
    'ວຽງຄຳ', 'ຫີນບູນ', 'ກາສີ',
  ],
  'ແຂວງໄຊສົມບູນ': [
    'ອະນຸວົງ', 'ລ້ອງ', 'ທ່າທອມ',
  ],
  'ແຂວງກຳມ່ວນ': [
    'ທ່າແຂກ', 'ນາກາຍ', 'ເທີນ', 'ຍ່ອມມະລາດ', 'ຊ່ອງລ່ອງ',
    'ຫີນບູນ', 'ໄຊຈຳພອນ', 'ນອງ', 'ບົວລະພາ',
  ],
  'ແຂວງສະຫວັນນະເຂດ': [
    'ໄກສອນ ພົມວິຫານ', 'ສອງຄອນ', 'ວິລະບູລີ', 'ນອງ', 'ທ່ງ',
    'ອາດສະພອນ', 'ໄຊບູລີ', 'ພີນ', 'ຊາມ', 'ຈຳລອນ',
    'ເຊໂປນ', 'ສຸວັນນະ', 'ສາວນ', 'ທ່ານລາວ', 'ຊ່ວງ',
  ],
  'ແຂວງສາລະວັນ': [
    'ສາລະວັນ', 'ທ່າແຕງ', 'ລະຄອນເພັງ', 'ຕຸ່ມລານ', 'ລາໂອງ', 'ຄົງ', 'ໂທ', 'ວາປີ',
  ],
  'ແຂວງເຊກອງ': [
    'ລະມາມ', 'ກະລຶມ', 'ທ່າຕ່ຳ', 'ດາກຈຶງ',
  ],
  'ແຂວງຈຳປາສັກ': [
    'ປາກເຊ', 'ຊະນະສົມບູນ', 'ໂພນທອງ', 'ປາກຊ່ອງ', 'ບາດ',
    'ບຸ່ງລອ', 'ມູນລະປະໂມກ', 'ສຸຂຸມາ', 'ໂຂງ', 'ລາວງາມ',
  ],
  'ແຂວງອັດຕະປື': [
    'ສາມັກຄີໄຊ', 'ໄຊສະຖານ', 'ສານ', 'ໂດ່', 'ສ',
  ],
}

export const PROVINCE_LIST = Object.keys(PROVINCES)
